# Pandas

## pandas ===> it is an open-source library that is used for handle data manupulations.

In [1]:
# Data structure : 
# (1) Series  (2) DataFrame

## Series

In [10]:
import pandas as pd

In [11]:
a = pd.Series([1,23,67,90])
a

0     1
1    23
2    67
3    90
dtype: int64

In [12]:
type(a)

pandas.core.series.Series

## (2) DataFrame

In [15]:
a = {
    "Emp_ID" : [1,2,3,4,5,6,7,8],
    "Name" : ['Sam', 'Mohit', 'Gorav', 'Aniket', 'Raj', 'Rahul', 'Deepak', 'Kunal'],
    "Department" : ['IT', 'HR', 'HR', 'IT', 'Operations', 'IT', 'Operations', 'HR'],
    "Working_Hours" : [8,9,9,9,9,9,6,7]
}
a

{'Emp_ID': [1, 2, 3, 4, 5, 6, 7, 8],
 'Name': ['Sam',
  'Mohit',
  'Gorav',
  'Aniket',
  'Raj',
  'Rahul',
  'Deepak',
  'Kunal'],
 'Department': ['IT',
  'HR',
  'HR',
  'IT',
  'Operations',
  'IT',
  'Operations',
  'HR'],
 'Working_Hours': [8, 9, 9, 9, 9, 9, 6, 7]}

In [18]:
type(a)

pandas.core.frame.DataFrame

In [19]:
df = pd.DataFrame(a)
df

   Emp_ID    Name  Department  Working_Hours
0       1     Sam          IT              8
1       2   Mohit          HR              9
2       3   Gorav          HR              9
3       4  Aniket          IT              9
4       5     Raj  Operations              9
5       6   Rahul          IT              9
6       7  Deepak  Operations              6
7       8   Kunal          HR              7

In [21]:
df.columns

Index(['Emp_ID', 'Name', 'Department', 'Working_Hours'], dtype='object')

In [22]:
df.head() #top 5 data

   Emp_ID    Name  Department  Working_Hours
0       1     Sam          IT              8
1       2   Mohit          HR              9
2       3   Gorav          HR              9
3       4  Aniket          IT              9
4       5     Raj  Operations              9

In [23]:
df.head(2)

   Emp_ID   Name Department  Working_Hours
0       1    Sam         IT              8
1       2  Mohit         HR              9

In [24]:
df.tail()

   Emp_ID    Name  Department  Working_Hours
3       4  Aniket          IT              9
4       5     Raj  Operations              9
5       6   Rahul          IT              9
6       7  Deepak  Operations              6
7       8   Kunal          HR              7

In [25]:
df.tail(2)

   Emp_ID    Name  Department  Working_Hours
6       7  Deepak  Operations              6
7       8   Kunal          HR              7

In [29]:
df.sample(4) # it returns random-indexed rows.

   Emp_ID    Name  Department  Working_Hours
5       6   Rahul          IT              9
6       7  Deepak  Operations              6
0       1     Sam          IT              8
2       3   Gorav          HR              9

In [30]:
df.describe() # i returns statically view of data.

        Emp_ID  Working_Hours
count  8.00000       8.000000
mean   4.50000       8.250000
std    2.44949       1.164965
min    1.00000       6.000000
25%    2.75000       7.750000
50%    4.50000       9.000000
75%    6.25000       9.000000
max    8.00000       9.000000

In [31]:
df.info() #complete overview of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Emp_ID         8 non-null      int64
 1   Name           8 non-null      object
 2   Department     8 non-null      object
 3   Working_Hours  8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 384.0+ bytes

In [ ]:
if you want to export your data in csv format

In [33]:
df.to_csv("C:\\Users\\deepak\\Summer Intership and Training\\Machine_Learning\\csv\\Emp_Info.csv")

In [34]:
df.to_csv("C:\\Users\\deepak\\Summer Intership and Training\\Machine_Learning\\csv\\New_Emp_Info.csv", index = False)

In [35]:
df.to_excel("C:\\Users\\deepak\\Summer Intership and Training\\Machine_Learning\\csv\\Old_Emp_Info.xlsx")

## How to open csv file in jupyter notebook

In [44]:
df = pd.read_csv("C:\\Users\\deepak\\Summer Intership and Training\\Machine_Learning\\csv\\New_Emp_Info.csv")

In [45]:
df.head()

   Emp_ID    Name  Department  Working_Hours
0       1     Sam          IT              8
1       2   Mohit          HR              9
2       3   Gorav          HR              9
3       4  Aniket          IT              9
4       5     Raj  Operations              9

In [46]:
df['Department']

0            IT
1            HR
2            HR
3            IT
4    Operations
5            IT
6    Operations
7            HR
Name: Department, dtype: object

In [48]:
df['Department'].value_counts()

IT            3
HR            3
Operations    2
Name: Department, dtype: int64

In [49]:
a = {
    "Emp_ID" : [1,2,3,4,5,6,7,8],
    "Name" : ['Sam', 'Mohit', 'Gorav', 'Aniket', 'Raj', 'Rahul', 'Deepak', 'Kunal'],
    "Department" : ['IT', 'HR', 'HR', 'IT', 'Operations', 'IT', 'Operations', 'HR'],
    "Working_Hours" : [8,9,9,9,9,9,6,7]
}
a

{'Emp_ID': [1, 2, 3, 4, 5, 6, 7, 8],
 'Name': ['Sam',
  'Mohit',
  'Gorav',
  'Aniket',
  'Raj',
  'Rahul',
  'Deepak',
  'Kunal'],
 'Department': ['IT',
  'HR',
  'HR',
  'IT',
  'Operations',
  'IT',
  'Operations',
  'HR'],
 'Working_Hours': [8, 9, 9, 9, 9, 9, 6, 7]}

In [50]:
df = pd.DataFrame(a)
df

   Emp_ID    Name  Department  Working_Hours
0       1     Sam          IT              8
1       2   Mohit          HR              9
2       3   Gorav          HR              9
3       4  Aniket          IT              9
4       5     Raj  Operations              9
5       6   Rahul          IT              9
6       7  Deepak  Operations              6
7       8   Kunal          HR              7

In [55]:
df['Name'][0] = 'Kriti'

C:\Users\deepak\AppData\Local\Temp\ipykernel_5664\1991129534.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = 'Kriti'

In [56]:
df

   Emp_ID    Name  Department  Working_Hours
0       1   Kriti          IT              8
1       2   Mohit          HR              9
2       3   Gorav          HR              9
3       4  Aniket          IT              9
4       5     Raj  Operations              9
5       6   Rahul          IT              9
6       7  Deepak  Operations              6
7       8   Kunal          HR              7

In [66]:
#Raj ==> working_hours =7
df['Name'][]

SyntaxError: invalid syntax (1884593884.py, line 2)

In [60]:
# loc and iloc

# df.loc['row_range','column_name']
# df.loc['row_range','column_range']

In [62]:
df.loc[2:5, ["Name", "Department"]]

     Name  Department
2   Gorav          HR
3  Aniket          IT
4     Raj  Operations
5   Rahul          IT

In [63]:
df.iloc[2:5, [1,2]]

     Name  Department
2   Gorav          HR
3  Aniket          IT
4     Raj  Operations

In [67]:
df['Name'][2] = None
df['Department'][3] = None
df['Department'][4] = None

C:\Users\deepak\AppData\Local\Temp\ipykernel_5664\2836322762.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][2] = None
C:\Users\deepak\AppData\Local\Temp\ipykernel_5664\2836322762.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][3] = None
C:\Users\deepak\AppData\Local\Temp\ipykernel_5664\2836322762.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Department'][4] = None

In [68]:
df

   Emp_ID    Name  Department  Working_Hours
0       1   Kriti          IT              8
1       2   Mohit          HR              9
2       3    None          HR              9
3       4  Aniket        None              9
4       5     Raj        None              9
5       6   Rahul          IT              9
6       7  Deepak  Operations              6
7       8   Kunal          HR              7

In [69]:
df.isnull() # it will returns true if you have missing values otherwise return False

   Emp_ID   Name  Department  Working_Hours
0   False  False       False          False
1   False  False       False          False
2   False   True       False          False
3   False  False        True          False
4   False  False        True          False
5   False  False       False          False
6   False  False       False          False
7   False  False       False          False

In [71]:
df.isnull().sum() #we can check total missing values

Emp_ID           0
Name             1
Department       2
Working_Hours    0
dtype: int64

In [73]:
df.notnull() # it will returns false if you have missing values otherwise return true

   Emp_ID   Name  Department  Working_Hours
0    True   True        True           True
1    True   True        True           True
2    True  False        True           True
3    True   True       False           True
4    True   True       False           True
5    True   True        True           True
6    True   True        True           True
7    True   True        True           True

In [74]:
df.notnull().sum() #we can check total present values

Emp_ID           8
Name             7
Department       6
Working_Hours    8
dtype: int64